// Напишите программу, которая принимает на вход число (N)
// и выдаёт таблицу кубов чисел от 1 до N.

          
         
          
          string number = Console.ReadLine();
                    
          Console.WriteLine(number[0]*number[0]*number[0]);
          
