// Напишите программу, которая принимает на вход число (N)
// и выдаёт таблицу кубов чисел от 1 до N.

          
         
          
          string numberN = Console.ReadLine();
                    
          Console.WriteLine(numberN[0]*numberN[0]*numberN[0]);
          
